# FilterStringGreater Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FilterStringGreater Properties
FilterStringGreater Class See Also
---
The FilterStringGreater type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity.  (Inherited from FilterStringRuleEvaluator.) |

# See Also
FilterStringGreater Class
Autodesk.Revit.DB Namespace